# Принципы SOLID. Благодаря этим принципам проект можно легко масштабировать и развивать.



# Что такое SOLID.
# Преимущества:
# 1 - простота поддержки:
# все программисты пишут одинаково и по одним и тем же принципам
# SOLID позволяет обозначить чёткие правила, которые все понимают одинаково

# 2 - простота расширения существующего функционала:
# старый функцинал не будет сломан

# 3 - простота разработки нового функционала
# добавление полностью нового функционала не поломает старый

# 4 - стабильное развитие системы в течение долгого времени:
# сложность системы будет расти линейно
# SOLID позволяет долгое время поддерживать систему, и она не скатится в говнокод



# Недостатки SOLID
# 1 - больше кода (классы, импорты, новые файлы)
# 2 - нужно думать. Не писать как попало, проверять фрагменты кода на соответвие SOLID


