# Open-Close

# Принцип открытости-закрытости
# Программные сущности должны быть открыты для расширения, но закрыты для модификаиции
# ~ Для добавления нового функционала должно быть легко дополнить код чем-то новым, и сложно заменить существующий

# Легко строить, сложно изменять

# Хороший пример:

# Добавление нового метода через создание дочернего класса
# Через наследование добавить дополнительное поведение методу (переопределить метод, добавив ему новый функционал)



# Плохой пример:

# Менять код уже существующего класса, чтобы добавить новый функицонал без изменения бизнес требований








